init.org
#+STARTUP: indent
#+TITLE: A literate Emacs configuration
#+DESCRIPTION: This file contains my Emacs init.el configuration as a literate program, which is generated by tangling this document.
#+PROPERTY: header-args :tangle init.el :comments link :results none

* Basic setup for init
** Lexical binding
We set the heading line of the file, to enable lexical
binding. This makes it easier to define variables to use in hooks
that are run later, etc. See [[gc-thresholds][gc-threshold src block]] for example.

#+BEGIN_SRC emacs-lisp :comments none
  ;;; init.el --- Load the full configuration -*- lexical-binding: t -*-
#+END_SRC

** Enable debug if required
Produce backtraces when errors occur: can be helpful to diagnose startup issues
#+BEGIN_SRC emacs-lisp
  ;; (setq debug-on-error t)
#+END_SRC

** Check that Emacs is not too old
#+BEGIN_SRC emacs-lisp
  (let ((minver "25.1"))
    (when (version< emacs-version minver)
      (error "Your Emacs is too old -- this config requires v%s or higher" minver)))

  (when (version< emacs-version "26.1")
    (message "Your Emacs is old, and some functionality in this config will be disabled. Please upgrade if possible."))
#+END_SRC

** Adjust garbage collection thresholds
Allow for a much higher garbage collection threshold during startup,
to prevent gc from slowing down startup.

#+name: gc-thresholds
#+BEGIN_SRC emacs-lisp
  (let ((normal-gc-cons-threshold (* 20 1024 1024))
        (init-gc-cons-threshold (* 128 1024 1024)))
    (setq gc-cons-threshold init-gc-cons-threshold)
    (add-hook 'emacs-startup-hook
              (lambda () (setq gc-cons-threshold normal-gc-cons-threshold))))
#+END_SRC

** ~init.el~ file generation
:PROPERTIES:
:CUSTOM_ID: my-make-init-el-function
:END:

We genarate the ~init.el~ file, whenever this file gets saved. We need
to save with a prefix argument, though. ~C-u C-x C-s~.

#+name: startup-code
#+BEGIN_SRC emacs-lisp
  (defun pc/tangle-init-el ()
    "Tangle the file to update init.el file."
    (interactive "P")
    (let* ((time (current-time)))
      (when current-prefix-arg
        ;; Make and load init.el
        (org-babel-tangle)
        ;; Acknowledgement
        (message
         "Tangled  init.el … %.06f seconds."
         (float-time (time-since time))))))

  (defun pc/load-init-el ()
    "Load the init.el file."
    (interactive)
    (let* ((time (current-time))
           (init-file (expand-file-name
                       "init.el"
                       (file-name-directory (buffer-file-name)))))

        ;; Make and load init.el
        (org-babel-tangle)
        ;; NOTE: Loading the init file doesn't work well...
        ;; We just tangle the file on save, and leave it at that. This
        ;; utility is left around, in case we occasionally chosee to
        ;; load the file manually. Ideally, when we are happy with the
        ;; config, we should just start a new Emacs instance.
        (setq pc/loading-tangled-init-p t)
        (load-file init-file)

        ;; Acknowledgement
        (message
         "Tangled, compiled, and loaded init.el … %.06f seconds. Restart Emacs if things get weird..."
         (float-time (time-since time)))))

  ;; Added this as a local variable in the org file
  ;; (add-hook 'after-save-hook 'org-babel-tangle nil 'local-to-this-file-please)
#+END_SRC
** Basic user information
#+begin_src emacs-lisp
  (setq user-full-name    "Puneeth Chaganti"
        user-mail-address "punchagan@muse-amuse.in")
#+end_src

For some fun, run this cute method.
#+BEGIN_SRC emacs-lisp :tangle no
  (animate-birthday-present user-full-name)
#+END_SRC
* Package manager and installation
** Setup ~package.el~
#+BEGIN_SRC emacs-lisp
  (require 'package)

  (setq package-archives '(("gnu"       . "http://elpa.gnu.org/packages/")
                           ("melpa"     . "http://melpa.org/packages/")))

  ;; Update local list of available packages. We don't want to do this
  ;; on start-up, right?
  ;; (package-refresh-contents)

  ;; Ensure the installed packages are on load-path
  (package-initialize)
#+END_SRC
** Setup ~use-package~

The declarative configuration tool [[https://github.com/jwiegley/use-package/][use-package]] is a macro/interface
that manages our packages and the way they interact.

#+BEGIN_SRC emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  ;; ~use-package.el~ is no longer needed at runtime
  ;; Put the following at the top of your Emacs, to reduce load time:
  (eval-when-compile
    (require 'use-package))

  (require 'diminish)
  (require 'bind-key)
#+END_SRC

To make the setup bootstrap itself, we use let ~use-package~
automatically download missing requirements.
 
#+begin_src emacs-lisp
  (setq use-package-always-ensure t)
#+end_src
** Auto update package
#+BEGIN_SRC emacs-lisp
  (use-package auto-package-update
    :config
    ;; Delete residual old versions
    (setq auto-package-update-delete-old-versions t)
    ;; Do not bother me when updates have taken place.
    (setq auto-package-update-hide-results t)
    ;; Update installed packages at startup if there is an update pending.
    (auto-package-update-maybe))
#+END_SRC
** System packages used from with-in Emacs
 
Sometimes Emacs packages depend on existing system binaries,
~use-package~ let's us ensure these exist using the
~:ensure-system-package~ keyword extension. This is a very powerful
system - see the documentation [[https://github.com/jwiegley/use-package#use-package-ensure-system-package][here]].

This is like ~:ensure t~ but operates at the OS level and uses your
default OS package manager. But, it can be customized to run specific
commands for update, etc.

We also run an auto-update for system packages, after an update for
Emacs packages is done ^_^.

#+BEGIN_SRC emacs-lisp
  ;; Auto installing OS system packages
  (use-package use-package-ensure-system-package
    :defer 4

    :config
    (setq system-packages-package-manager 'apt
          system-packages-use-sudo t)
    (unless (boundp 'pc/loading-tangled-init-p)
      (system-packages-update)))

  ;; Please don't bother me when shell buffer names are in use, just make a new
  ;; buffer.
  (setq async-shell-command-buffer 'new-buffer)

  ;; Display the output buffer for asynchronous shell commands only when the
  ;; command generates output.
  (setq async-shell-command-display-buffer nil)

  ;; Don't ask me if I want to kill a buffer with a live process attached to it;
  ;; just kill it please.
  (setq kill-buffer-query-functions
        (remq 'process-kill-buffer-query-function
              kill-buffer-query-functions))
#+END_SRC

* $PATH and such stuff
** Setup exec-path 
To be able to find external programs, we want our ~exec-path~ to be as
close to ~$PATH~ as possible.

NOTE: When starting emacs from Gnome Shell, the env vars in
bash_profile are not in the env anyway? May be there's another trick,
or may be don't start emacs from Gnome Shell?

The block below is left here, because it seems to copy other useful
things like LANG, etc.

#+BEGIN_SRC emacs-lisp
  (use-package exec-path-from-shell

    :config
    (dolist (var '("SSH_AUTH_SOCK" "SSH_AGENT_PID" "GPG_AGENT_INFO" "LANG" "LC_CTYPE"))
      (add-to-list 'exec-path-from-shell-variables var))

    (when (or (memq window-system '(mac ns x))
              (unless (memq system-type '(ms-dos windows-nt))
                (daemonp)))
      (exec-path-from-shell-initialize)))
#+END_SRC
** Use authinfo gpg file
#+BEGIN_SRC emacs-lisp
  (setq auth-sources '("~/.authinfo.gpg"))
#+END_SRC
** Start Emacs server
#+BEGIN_SRC emacs-lisp
  (server-start)
#+END_SRC

* Editor UI & Behavior
* Random Quote
Show a random quote when Emacs is idle for 5 minutes
#+BEGIN_SRC emacs-lisp
  (require 'json)

  (defun pc/get-random-quote ()
    (let* ((json-array-type 'list)
           (quotes-file "quotes.json")
           (quotes (and (file-exists-p quotes-file)
                        (json-read-file quotes-file)))
           (n (random (length quotes)))
           (q (nth n quotes))
           (text (cdr (assoc 'body q)))
           (source (cdr (assoc 'source q))))
      (format "%s -- %s" text source)))

  (unless (boundp 'pc/quotes-timer)
    (setq pc/quotes-timer
          (run-with-idle-timer
           300
           'repeat-forever
           (lambda () (message (pc/get-random-quote))))))
#+END_SRC
** Lean UI
#+BEGIN_SRC emacs-lisp
  ;; No startup message
  (setq inhibit-startup-message t)

  (setq-default
   initial-scratch-message
   (format ";; Happy hacking, %s - Emacs ♥ you!\n\n" user-login-name))

  ;; No tool-bar, menu-bar and scroll-bar
  (tool-bar-mode   -1)
  (menu-bar-mode   -1)
  (scroll-bar-mode -1)

  ;; More prominent window divider
  (window-divider-mode 1)
#+END_SRC
