init.org
** Basic Preferences

Miscellaneous basic preferences for basic editor actions (foreground &
background).

#+BEGIN_SRC emacs-lisp
  ;; Basic preferences (taken from purcell)
  (setq-default
   blink-cursor-interval 0.4
   bookmark-default-file (expand-file-name ".bookmarks.el" user-emacs-directory)
   buffers-menu-max-size 30
   case-fold-search t
   column-number-mode t
   confirm-kill-emacs (lambda (t) (y-or-n-p (format "%s\n%s" (pc/get-random-quote) t)))
   indent-tabs-mode nil
   create-lockfiles nil
   auto-save-default nil
   mouse-yank-at-point t
   save-interprogram-paste-before-kill t
   scroll-preserve-screen-position 'always
   set-mark-command-repeat-pop t
   tooltip-delay 1.5
   truncate-lines nil
   truncate-partial-width-windows nil)
#+END_SRC

Some more basic preferences which are called in the ~after-init-hook~.

#+BEGIN_SRC emacs-lisp
  (add-hook 'after-init-hook 'delete-selection-mode)

  (add-hook 'after-init-hook 'global-auto-revert-mode)
  (setq global-auto-revert-non-file-buffers t
        auto-revert-verbose nil)
  (with-eval-after-load 'autorevert
    (diminish 'auto-revert-mode))

  (add-hook 'after-init-hook 'transient-mark-mode)
#+END_SRC

Let's save a few precious seconds

#+begin_src emacs-lisp
;; change all prompts to y or n
(fset 'yes-or-no-p 'y-or-n-p)

;; Enable all ‘possibly confusing commands’ such as helpful but
;; initially-worrisome “narrow-to-region”, C-x n n.
(setq-default disabled-command-function nil)
#+end_src

** Fill column indicator
#+BEGIN_SRC emacs-lisp
  (when (boundp 'display-fill-column-indicator)
    (setq-default indicate-buffer-boundaries 'left)
    (setq-default display-fill-column-indicator-character ?│)
    (add-hook 'prog-mode-hook 'display-fill-column-indicator-mode))
#+END_SRC

** ~diminish~ for modeline indicators

This should probably have automatically come as a dependency of
~use-package~, but doesn't seem to be. (It should at least warn about
missing package)

#+BEGIN_SRC emacs-lisp
  (use-package diminish
    :defer 3 ;; load after 5 seconds of idle time

    :config ;; Let's hide some markers.
    (diminish 'org-indent-mode))
#+END_SRC
** Use ~which-key~ for discovery
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :diminish
    :config (which-key-mode)
    (which-key-setup-side-window-bottom)
    (setq which-key-idle-delay 0.5))
#+END_SRC
** Restore previous session
The following is disabled. I found it a nuisance to have my files open
across sessions. If I'm closing Emacs, it's for a good reason.

#+BEGIN_SRC emacs-lisp :tangle no
  ;; Keep open files open across sessions.
  (desktop-save-mode 1)
  (setq desktop-restore-eager 10)
#+END_SRC
** Completion and Narrowing

See this [[https://writequit.org/denver-emacs/presentations/2017-04-11-ivy.html][blog post]] for more configuration options, and other packages
to install, etc.

Hit ~M-o~ to see the available actions in ivy/counsel completion
buffers! For instance, ~counsel-find-file~ allows copying, deleting or
renaming files!

#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :diminish
    :ensure-system-package (ag . silversearcher-ag)
    :bind*                              ; load when pressed
    (("C-s"     . swiper)
     ("C-S-s" . counsel-ag)               ; Use ag to search the repo
     ("<f1> l"  . counsel-find-library)   ; find an Emacs Lisp library
     ("<f2> u"  . counsel-unicode-char))  ; insert a unicode symbol using a pop-up
    )
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package ivy
    :diminish
    :config
    ;; add ‘recentf-mode’ and bookmarks to ‘ivy-switch-buffer’.
    (setq ivy-use-virtual-buffers t)
    ;; Number of lines to display
    (setq ivy-height 10)
    (setq ivy-count-format "[%d/%d] ")
    ;; no initial regexp by default (see original value using
    ;; `describe-variable')
    (setq ivy-initial-inputs-alist nil)
    (ivy-mode 1)
    (counsel-mode 1))
#+END_SRC

~swiper~ is an alternative to Emacs' default incremental search.
** Themes

#+BEGIN_SRC emacs-lisp
  ;; Don't prompt to confirm theme safety. This avoids problems with
  ;; first-time startup on Emacs > 26.3.
  (setq custom-safe-themes t)
#+END_SRC
*** Some code to pick and load a theme

#+BEGIN_SRC emacs-lisp
  (defun pc/load-theme (theme)
    "Apply user theme."
    (interactive
     (list
      (intern (ivy-read "Load custom theme: "
                        (mapcar #'symbol-name
                                (custom-available-themes))))))
    (progn
      ;; Disable all previously enabled themes
      (mapc 'disable-theme custom-enabled-themes)
      ;; Load chosen theme
      (load-theme theme)))
#+END_SRC

*** Ensure some nice themes are available
#+BEGIN_SRC emacs-lisp
  (use-package base16-theme)
  (unless (boundp 'pc/loading-tangled-init-p)
    (pc/load-theme 'base16-humanoid-dark))
#+END_SRC
** Symbol overlays
#+BEGIN_SRC emacs-lisp
  (use-package symbol-overlay
    :defer t
    :diminish t
    :hook
    (prog-mode . symbol-overlay-mode)
    (html-mode . symbol-overlay-mode)
    (yaml-mode . symbol-overlay-mode)
    (conf-mode . symbol-overlay-mode)
    :bind (:map symbol-overlay-mode-map
                ("M-i" . symbol-overlay-put)
                ("M-I" . symbol-overlay-remove-all)
                ("M-n" . symbol-overlay-jump-next)
                ("M-p" . symbol-overlay-jump-prev)))
#+END_SRC

** Rainbow delimiters
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :defer t
    :diminish t
    :hook
    (prog-mode . rainbow-delimiters-mode))
#+END_SRC

** Subword and super-word modes
#+BEGIN_SRC emacs-lisp
  (with-eval-after-load 'subword
    (diminish 'subword-mode)
    (diminish 'superword-mode))
#+END_SRC

** Large files

#+BEGIN_SRC emacs-lisp
  (when (fboundp 'so-long-enable)
    (add-hook 'after-init-hook 'so-long-enable))

  ;; Use vlf package for very large files
  (use-package vlf)

  (defun ffap-vlf ()
    "Find file at point with VLF."
    (interactive)
    (let ((file (ffap-file-at-point)))
      (unless (file-exists-p file)
        (error "File does not exist: %s" file))
      (vlf file)))
#+END_SRC

** Emacs backups

Emacs only saves backups on the first save, an not every save. One
could set ~buffer-backed-up~ to ~nil~ on the ~before-save-hook~, to
trigger a backup on each save.

There's also a ~backup-walker~ package that may be useful, if we are
into back-ups a lot. But, currently, almost everything that I work on,
is in ~git~ and it doesn't seem super useful to have so much setup for
backups.

#+BEGIN_SRC emacs-lisp
  ;; New location for backups.
  (setq backup-directory-alist
        `(("." . ,(expand-file-name "backups" user-emacs-directory))))

  ;; Silently delete execess backup versions
  (setq delete-old-versions t)

  ;; Only keep the last 3 backups of a file.
  (setq kept-old-versions 3)

  ;; Even version controlled files get to be backed up.
  (setq vc-make-backup-files t)

  ;; Use version numbers for backup files.
  (setq version-control t)
#+END_SRC

* Programming
** magit and git related stuff

For a full tutorial see [[http://jr0cket.co.uk/2012/12/driving-git-with-emacs-pure-magic-with.html.html][jr0cket's blog]].

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :bind
    ("C-x g" . magit-status)
    ("C-c b" . magit-blame)
    :custom
    ;; Show word diffs for current hunk
    (magit-diff-refine-hunk t)
    ;; Do not ask about this variable when cloning.
    (magit-clone-set-remote.pushDefault t))
#+END_SRC

# FIXME: Set ~magit-repository-directories~, or projectile directories
# to quickly open projects.

*** Git helpers
#+BEGIN_SRC emacs-lisp
  ;; Incremental blame?
  (use-package git-blamed
    :defer t)

  ;; Major mode to edit git ignore files
  (use-package gitignore-mode
    :defer t)

  ;; Major mode to edit git config files
  (use-package gitconfig-mode
    :defer t)

  ;; Highlight diffs
  (use-package diff-hl
    :defer
    :config
    (global-diff-hl-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
  ;; NOTE: DISABLED because I don't really like the pop-ups, and prefer magit blame!
  ;; M-x git-messenger:popup-message
  (use-package git-messenger
    :custom
    ;; Always show who authored the commit and when.
    (git-messenger:show-detail t)
    ;; Message menu let's us use magit diff to see the commit change.
    (git-messenger:use-magit-popup t))
#+END_SRC

*** Magit helpers
#+BEGIN_SRC emacs-lisp
  (use-package magit-todos)
#+END_SRC

