init.el

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Basic Preferences][Basic Preferences:1]]
;; Basic preferences (taken from purcell)
(setq-default
 blink-cursor-interval 0.4
 bookmark-default-file (expand-file-name ".bookmarks.el" user-emacs-directory)
 buffers-menu-max-size 30
 case-fold-search t
 column-number-mode t
 confirm-kill-emacs 'y-or-n-p
 indent-tabs-mode nil
 create-lockfiles nil
 auto-save-default nil
 mouse-yank-at-point t
 save-interprogram-paste-before-kill t
 scroll-preserve-screen-position 'always
 set-mark-command-repeat-pop t
 tooltip-delay 1.5
 truncate-lines nil
 truncate-partial-width-windows nil)
;; Basic Preferences:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Basic Preferences][Basic Preferences:2]]
(add-hook 'after-init-hook 'delete-selection-mode)

(add-hook 'after-init-hook 'global-auto-revert-mode)
(setq global-auto-revert-non-file-buffers t
      auto-revert-verbose nil)
(with-eval-after-load 'autorevert
  (diminish 'auto-revert-mode))

(add-hook 'after-init-hook 'transient-mark-mode)
;; Basic Preferences:2 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Basic Preferences][Basic Preferences:3]]
;; change all prompts to y or n
(fset 'yes-or-no-p 'y-or-n-p)

;; Enable all ‘possibly confusing commands’ such as helpful but
;; initially-worrisome “narrow-to-region”, C-x n n.
(setq-default disabled-command-function nil)
;; Basic Preferences:3 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Fill column indicator][Fill column indicator:1]]
(when (boundp 'display-fill-column-indicator)
  (setq-default indicate-buffer-boundaries 'left)
  (setq-default display-fill-column-indicator-character ?│)
  (add-hook 'prog-mode-hook 'display-fill-column-indicator-mode))
;; Fill column indicator:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*~diminish~ for modeline indicators][~diminish~ for modeline indicators:1]]
(use-package diminish
  :defer 3 ;; load after 5 seconds of idle time

  :config ;; Let's hide some markers.
  (diminish 'org-indent-mode))
;; ~diminish~ for modeline indicators:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Use ~which-key~ for discovery][Use ~which-key~ for discovery:1]]
(use-package which-key
  :diminish
  :config (which-key-mode)
  (which-key-setup-side-window-bottom)
  (setq which-key-idle-delay 0.5))
;; Use ~which-key~ for discovery:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Completion and Narrowing][Completion and Narrowing:1]]
(use-package counsel
  :diminish
  :ensure-system-package (ag . silversearcher-ag)
  :bind*                              ; load when pressed
  (("C-s"     . swiper)
   ("C-S-s" . counsel-ag)               ; Use ag to search the repo
   ("<f1> l"  . counsel-find-library)   ; find an Emacs Lisp library
   ("<f2> u"  . counsel-unicode-char))  ; insert a unicode symbol using a pop-up
  )
;; Completion and Narrowing:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Completion and Narrowing][Completion and Narrowing:2]]
(use-package ivy
  :diminish
  :config
  ;; add ‘recentf-mode’ and bookmarks to ‘ivy-switch-buffer’.
  (setq ivy-use-virtual-buffers t)
  ;; Number of lines to display
  (setq ivy-height 10)
  (setq ivy-count-format "[%d/%d] ")
  ;; no initial regexp by default (see original value using
  ;; `describe-variable')
  (setq ivy-initial-inputs-alist nil)
  (ivy-mode 1)
  (counsel-mode 1))
;; Completion and Narrowing:2 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Themes][Themes:1]]
;; Don't prompt to confirm theme safety. This avoids problems with
;; first-time startup on Emacs > 26.3.
(setq custom-safe-themes t)
;; Themes:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Some code to pick and load a theme][Some code to pick and load a theme:1]]
(defun pc/load-theme (theme)
  "Apply user theme."
  (interactive
   (list
    (intern (ivy-read "Load custom theme: "
                      (mapcar #'symbol-name
                              (custom-available-themes))))))
  (progn
    ;; Disable all previously enabled themes
    (mapc 'disable-theme custom-enabled-themes)
    ;; Load chosen theme
    (load-theme theme)))
;; Some code to pick and load a theme:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Ensure some nice themes are available][Ensure some nice themes are available:1]]
(use-package base16-theme)
(unless (boundp 'pc/loading-tangled-init-p)
  (pc/load-theme 'base16-humanoid-dark))
;; Ensure some nice themes are available:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Symbol overlays][Symbol overlays:1]]
(use-package symbol-overlay
  :defer t
  :diminish t
  :hook
  (prog-mode . symbol-overlay-mode)
  (html-mode . symbol-overlay-mode)
  (yaml-mode . symbol-overlay-mode)
  (conf-mode . symbol-overlay-mode)
  :bind (:map symbol-overlay-mode-map
              ("M-i" . symbol-overlay-put)
              ("M-I" . symbol-overlay-remove-all)
              ("M-n" . symbol-overlay-jump-next)
              ("M-p" . symbol-overlay-jump-prev)))
;; Symbol overlays:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Rainbow delimiters][Rainbow delimiters:1]]
(use-package rainbow-delimiters
  :defer t
  :diminish t
  :hook
  (prog-mode . rainbow-delimiters-mode))
;; Rainbow delimiters:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Subword and super-word modes][Subword and super-word modes:1]]
(with-eval-after-load 'subword
  (diminish 'subword-mode)
  (diminish 'superword-mode))
;; Subword and super-word modes:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Large files][Large files:1]]
(when (fboundp 'so-long-enable)
  (add-hook 'after-init-hook 'so-long-enable))

;; Use vlf package for very large files
(use-package vlf)

(defun ffap-vlf ()
  "Find file at point with VLF."
  (interactive)
  (let ((file (ffap-file-at-point)))
    (unless (file-exists-p file)
      (error "File does not exist: %s" file))
    (vlf file)))
;; Large files:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Emacs backups][Emacs backups:1]]
;; New location for backups.
(setq backup-directory-alist
      `(("." . ,(expand-file-name "backups" user-emacs-directory))))

;; Silently delete execess backup versions
(setq delete-old-versions t)

;; Only keep the last 3 backups of a file.
(setq kept-old-versions 3)

;; Even version controlled files get to be backed up.
(setq vc-make-backup-files t)

;; Use version numbers for backup files.
(setq version-control t)
;; Emacs backups:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*magit and git related stuff][magit and git related stuff:1]]
(use-package magit
  :bind
  ("C-x g" . magit-status)
  ("C-c b" . magit-blame)
  :custom
  ;; Show word diffs for current hunk
  (magit-diff-refine-hunk t)
  ;; Do not ask about this variable when cloning.
  (magit-clone-set-remote.pushDefault t))
;; magit and git related stuff:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Git helpers][Git helpers:1]]
;; Incremental blame?
(use-package git-blamed
  :defer t)

;; Major mode to edit git ignore files
(use-package gitignore-mode
  :defer t)

;; Major mode to edit git config files
(use-package gitconfig-mode
  :defer t)

;; Highlight diffs
(use-package diff-hl
  :defer
  :config
  (global-diff-hl-mode))
;; Git helpers:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Magit helpers][Magit helpers:1]]
(use-package magit-todos)
;; Magit helpers:1 ends here
