init.org
*** GitHub helpers

Get links/browse the file/commit on GitHub.

#+BEGIN_SRC emacs-lisp
  ;; More generic is “browse-at-remote”.
  ;; Not very useful, if we have git-link?
  ;; (use-package github-browse-file :defer t)

  ;; Link to specific parts of a file
  (use-package git-link :defer t)

  ;; Gists from Emacs
  (use-package yagist :defer t)

  ;; Turn references to PRs/Issues to clickable links
  ;; PR emacs/2 (Only the number is used -- emacs is ignored)
  ;; Bug 2 also works
  (use-package bug-reference-github
    :hook
    (prog-mode . bug-reference-github-set-url-format))

  (use-package github-review :defer t)

  (use-package forge :after magit)
#+END_SRC

*** For other VCS
I haven't used anything other than ~git~ for a while now, but these
packages seem like useful tools for other kinds of repositories.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package magit-svn
    :hook (magit-mode . magit-svn-mode))

  ;; magit for hg
  (use-package monky)
#+END_SRC

** TODOs highlighting

Global TODOs highlighting

#+BEGIN_SRC emacs-lisp
  ;; NOTE that the highlighting works even in comments.
  (use-package hl-todo
    ;; I want todo-words highlighted in prose, not just in code fragements.
    :hook (org-mode . hl-todo-mode)
    :config
    ;; Enable it everywhere.
    (global-hl-todo-mode))
#+END_SRC

Show TODO keywords in magit status buffer!

#+BEGIN_SRC emacs-lisp
  (use-package magit-todos
    :after magit
    :after hl-todo
    :config
    (magit-todos-mode))
#+END_SRC

* Prose and Literate Programming
** Org Agenda
*** Basic config
#+BEGIN_SRC emacs-lisp
  (setq org-directory "~/.life-in-plain-text/src/")
  (setq org-agenda-files
        (expand-file-name "agenda-files.org" org-directory))

  ;; Enable a bunch of things, since we are going to use them, anyway..
  (require 'org-clock)
  (require 'org-agenda)
  (require 'org-capture)
#+END_SRC
*** Super agenda
#+BEGIN_SRC emacs-lisp
  (use-package org-super-agenda
    :defer t)

  (use-package org-ql
      :defer t)

  ;; FIXME: Add some filters and stuff to make it more useful?
#+END_SRC
*** What are you doing?
**** Template to capture entries
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-capture-templates
               '("j"
                 "Journal"
                 entry
                 (file+olp+datetree "journal.org")
                 "* %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n%a\n"))
#+END_SRC
**** Custom code to fire off journal mode

Simple function to insert the template at the correct location, and
display it with the drawers hidden. We could simply use the capture
template instead of this magic, but this gives us a better UI to be
able to just go ahead and type what we want, instead of being in a
"capture" mode.

#+BEGIN_SRC emacs-lisp
  (defun pc/insert-journal-template ()
    (org-capture nil "j")
    (org-capture-finalize)
    (org-capture-goto-last-stored)
    (org-cycle-hide-drawers 'all)
    (org-end-of-line))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun pc/journal ()
    "Open a new frame for journaling.
      - Jumps to the currently clocked item, if there is one.

      - Otherwise, opens to the current day in the journal, and creates
        a new day entry if not already present."
    (interactive)
    (let* ((title "What are you doing?")
           (frame (or
                   (car (filtered-frame-list
                         (lambda (f)
                           (string= title (cdr (assq 'title (frame-parameters f)))))))
                   (make-frame
                    `((title . ,title)
                      (fullscreen . maximized))))))
      (select-frame frame)
      (org-agenda nil "a")
      (org-super-agenda-mode t)
      (org-agenda-log-mode t)
      (org-agenda-day-view)
      (org-agenda-goto-today)
      (delete-other-windows)
      (split-window-right)
      (if (org-clocking-p)
          (org-clock-goto)
        (pc/insert-journal-template))
      (org-narrow-to-subtree)
      (outline-show-subtree)
      (when (org-clocking-p)
        (goto-char (buffer-end 1)))
      (shell-command (format "wmctrl -a \"%s\"" title))))
#+END_SRC
* Using Emacs from the "outside"
** Emacs Anywhere 
Add the ability to use Emacs from input area. 

We need to manually configure a keybinding to run
=~/.emacs_anywhere/bin/run=.

#+BEGIN_SRC text :tangle fake-lisp/README.md :results none :comments none
  This directory contains fake packages that we create to be able to use
  the `use-package` and it's wonderful `:ensure-system-package`
  functionality.
#+END_SRC 

#+BEGIN_SRC emacs-lisp :tangle fake-lisp/emacs-anywhere.el :comments link :results none
  ;; This is a fake package created by us to try to ensure system packages
  (provide 'emacs-anywhere)
  ;;; emacs-anywhere ends here
#+END_SRC 

#+BEGIN_SRC emacs-lisp
  (defun pc/github-conversation-p (window-title)
    (or (string-match-p "Pull Request #" window-title)
        (string-match-p "Issue #" window-title)))

  (defun pc/ea-popup-handler (app-name window-title x y w h)
    ;; set major mode
    (cond
     ;; ((pc/github-conversation-p window-title) (gfm-mode))
     ;; default major mode
     (t (org-mode))))
#+END_SRC 

#+BEGIN_SRC emacs-lisp
  (use-package emacs-anywhere
    :defer 5
    :load-path "fake-lisp"

    :ensure-system-package
    ((xclip . xclip)
     (xdotool . xdotool)
     (xwininfo . xwininfo)
     ;; NOTE: The script itself checks for deps, and installing deps
     ;; asynchronously may cause the script to fail. Reloading the
     ;; requirement after other system deps are installed makes it work.
     ("~/.emacs_anywhere/bin/run" . "curl-bash-install https://raw.github.com/zachcurry/emacs-anywhere/master/install"))

    :config
    (add-hook 'ea-popup-hook 'pc/ea-popup-handler))
#+END_SRC

* COMMENT Local Variables
# Local Variables:
# eval: (add-hook 'after-save-hook 'pc/tangle-init-el nil 'local-to-this-file-please)
# End:
 
