init.el

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*GitHub helpers][GitHub helpers:1]]
;; More generic is “browse-at-remote”.
;; Not very useful, if we have git-link?
;; (use-package github-browse-file :defer t)

;; Link to specific parts of a file
(use-package git-link :defer t)

;; Gists from Emacs
(use-package yagist :defer t)

;; Turn references to PRs/Issues to clickable links
;; PR emacs/2 (Only the number is used -- emacs is ignored)
;; Bug 2 also works
(use-package bug-reference-github
  :hook
  (prog-mode . bug-reference-github-set-url-format))

(use-package github-review :defer t)

(use-package forge :after magit)
;; GitHub helpers:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*TODOs highlighting][TODOs highlighting:1]]
;; NOTE that the highlighting works even in comments.
(use-package hl-todo
  ;; I want todo-words highlighted in prose, not just in code fragements.
  :hook (org-mode . hl-todo-mode)
  :config
  ;; Enable it everywhere.
  (global-hl-todo-mode))
;; TODOs highlighting:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*TODOs highlighting][TODOs highlighting:2]]
(use-package magit-todos
  :after magit
  :after hl-todo
  :config
  (magit-todos-mode))
;; TODOs highlighting:2 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Basic config][Basic config:1]]
(setq org-directory "~/.life-in-plain-text/src/")
(setq org-agenda-files
      (expand-file-name "agenda-files.org" org-directory))

;; Enable a bunch of things, since we are going to use them, anyway..
(require 'org-clock)
(require 'org-agenda)
(require 'org-capture)
;; Basic config:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Super agenda][Super agenda:1]]
(use-package org-super-agenda
  :defer t)

(use-package org-ql
    :defer t)

;; FIXME: Add some filters and stuff to make it more useful?
;; Super agenda:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Template to capture entries][Template to capture entries:1]]
(add-to-list 'org-capture-templates
             '("j"
               "Journal"
               entry
               (file+olp+datetree "journal.org")
               "* %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n%a\n"))
;; Template to capture entries:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Custom code to fire off journal mode][Custom code to fire off journal mode:1]]
(defun pc/insert-journal-template ()
  (org-capture nil "j")
  (org-capture-finalize)
  (org-capture-goto-last-stored)
  (org-cycle-hide-drawers 'all)
  (org-end-of-line))
;; Custom code to fire off journal mode:1 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Custom code to fire off journal mode][Custom code to fire off journal mode:2]]
(defun pc/journal ()
  "Open a new frame for journaling.
    - Jumps to the currently clocked item, if there is one.

    - Otherwise, opens to the current day in the journal, and creates
      a new day entry if not already present."
  (interactive)
  (let* ((title "What are you doing?")
         (frame (or
                 (car (filtered-frame-list
                       (lambda (f)
                         (string= title (cdr (assq 'title (frame-parameters f)))))))
                 (make-frame
                  `((title . ,title)
                    (user-position . t)
                    (left . (+ 550))
                    (top . (+ 400))
                    (width . 120)
                    (height . 40))))))
    (select-frame frame)
    (org-agenda nil "a")
    (org-super-agenda-mode t)
    (org-agenda-log-mode t)
    (org-agenda-day-view)
    (org-agenda-goto-today)
    (delete-other-windows)
    (split-window-right)
    (if (org-clocking-p)
        (org-clock-goto)
      (pc/insert-journal-template))
    (org-narrow-to-subtree)
    (outline-show-subtree)
    (when (org-clocking-p)
      (goto-char (buffer-end 1)))
    (shell-command (format "wmctrl -a \"%s\"" title))))
;; Custom code to fire off journal mode:2 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Emacs Anywhere][Emacs Anywhere:3]]
(defun pc/github-conversation-p (window-title)
  (or (string-match-p "Pull Request #" window-title)
      (string-match-p "Issue #" window-title)))

(defun pc/ea-popup-handler (app-name window-title x y w h)
  ;; set major mode
  (cond
   ;; ((pc/github-conversation-p window-title) (gfm-mode))
   ;; default major mode
   (t (org-mode))))
;; Emacs Anywhere:3 ends here

;; [[file:~/software/my-repos/my-dot-emacs/init.org::*Emacs Anywhere][Emacs Anywhere:4]]
(use-package emacs-anywhere
  :defer 5
  :load-path "fake-lisp"

  :ensure-system-package
  ((xclip . xclip)
   (xdotool . xdotool)
   (xwininfo . xwininfo)
   ;; NOTE: The script itself checks for deps, and installing deps
   ;; asynchronously may cause the script to fail. Reloading the
   ;; requirement after other system deps are installed makes it work.
   ("~/.emacs_anywhere/bin/run" . "curl-bash-install https://raw.github.com/zachcurry/emacs-anywhere/master/install"))

  :config
  (add-hook 'ea-popup-hook 'pc/ea-popup-handler))
;; Emacs Anywhere:4 ends here
